IOsonata/IOsonata/ARM/Microchip/SAM4L/include/sam4lc8x.h
// Peripheral instances on HTOP2 bridge
#define ID_PM            64 /**< \brief Power Manager (PM) */
#define ID_CHIPID        65 /**< \brief Chip ID Registers (CHIPID) */
#define ID_SCIF          66 /**< \brief System Control Interface (SCIF) */
#define ID_FREQM         67 /**< \brief Frequency Meter (FREQM) */
#define ID_GPIO          68 /**< \brief General-Purpose Input/Output Controller (GPIO) */

// Peripheral instances on HTOP3 bridge
#define ID_BPM           96 /**< \brief Backup Power Manager (BPM) */
#define ID_BSCIF         97 /**< \brief Backup System Control Interface (BSCIF) */
#define ID_AST           98 /**< \brief Asynchronous Timer (AST) */
#define ID_WDT           99 /**< \brief Watchdog Timer (WDT) */
#define ID_EIC          100 /**< \brief External Interrupt Controller (EIC) */
#define ID_PICOUART     101 /**< \brief Pico UART (PICOUART) */

#define ID_PERIPH_COUNT 102 /**< \brief Number of peripheral IDs */
/*@}*/

/* ************************************************************************** */
/**  BASE ADDRESS DEFINITIONS FOR SAM4LC8x */
/* ************************************************************************** */
/** \addtogroup SAM4LC8x_base Peripheral Base Address Definitions */
/*@{*/

#if defined(__ASSEMBLY__) || defined(__IAR_SYSTEMS_ASM__)
#define SAM4L_ABDACB                        (0x40064000U) /**< \brief (ABDACB) APB Base Address */
#define SAM4L_ACIFC                         (0x40040000U) /**< \brief (ACIFC) APB Base Address */
#define SAM4L_ADCIFE                        (0x40038000U) /**< \brief (ADCIFE) APB Base Address */
#define SAM4L_AESA                          (0x400B0000U) /**< \brief (AESA) AHB Base Address */
#define SAM4L_AST                           (0x400F0800U) /**< \brief (AST) APB Base Address */
#define SAM4L_BPM                           (0x400F0000U) /**< \brief (BPM) APB Base Address */
#define SAM4L_BSCIF                         (0x400F0400U) /**< \brief (BSCIF) APB Base Address */
#define SAM4L_CATB                          (0x40070000U) /**< \brief (CATB) APB Base Address */
#define SAM4L_CHIPID                        (0x400E0400U) /**< \brief (CHIPID) APB Base Address */
#define SAM4L_CRCCU                         (0x400A4000U) /**< \brief (CRCCU) APB Base Address */
#define SAM4L_DACC                          (0x4003C000U) /**< \brief (DACC) APB Base Address */
#define SAM4L_EIC                           (0x400F1000U) /**< \brief (EIC) APB Base Address */
#define SAM4L_HFLASHC                       (0x400A0000U) /**< \brief (HFLASHC) APB Base Address */
#define SAM4L_HFLASHC_FROW                  (0x00800200U) /**< \brief (HFLASHC) FROW Base Address */
#define SAM4L_HFLASHC_USER                  (0x00800000U) /**< \brief (HFLASHC) USER Base Address */
#define SAM4L_FREQM                         (0x400E0C00U) /**< \brief (FREQM) APB Base Address */
#define SAM4L_GLOC                          (0x40060000U) /**< \brief (GLOC) APB Base Address */
#define SAM4L_GPIO                          (0x400E1000U) /**< \brief (GPIO) APB Base Address */
#define SAM4L_HCACHE                        (0x400A0400U) /**< \brief (HCACHE) APB Base Address */
#define SAM4L_HMATRIX                       (0x400A1000U) /**< \brief (HMATRIX) APB Base Address */
#define SAM4L_IISC                          (0x40004000U) /**< \brief (IISC) APB Base Address */
#define SAM4L_LCDCA                         (0x40080000U) /**< \brief (LCDCA) APB Base Address */
#define SAM4L_PARC                          (0x4006C000U) /**< \brief (PARC) APB Base Address */
#define SAM4L_PDCA                          (0x400A2000U) /**< \brief (PDCA) APB Base Address */
#define SAM4L_PEVC                          (0x400A6000U) /**< \brief (PEVC) APB Base Address */
#define SAM4L_PICOUART                      (0x400F1400U) /**< \brief (PICOUART) APB Base Address */
#define SAM4L_PM                            (0x400E0000U) /**< \brief (PM) APB Base Address */
#define SAM4L_SCIF                          (0x400E0800U) /**< \brief (SCIF) APB Base Address */
#define SAM4L_SMAP                          (0x400A3000U) /**< \brief (SMAP) APB Base Address */
#define SAM4L_SPI                           (0x40008000U) /**< \brief (SPI) APB Base Address */
#define SAM4L_TC0                           (0x40010000U) /**< \brief (TC0) APB Base Address */
#define SAM4L_TC1                           (0x40014000U) /**< \brief (TC1) APB Base Address */
#define SAM4L_TRNG                          (0x40068000U) /**< \brief (TRNG) APB Base Address */
#define SAM4L_TWIM0                         (0x40018000U) /**< \brief (TWIM0) APB Base Address */
#define SAM4L_TWIM1                         (0x4001C000U) /**< \brief (TWIM1) APB Base Address */
#define SAM4L_TWIM2                         (0x40078000U) /**< \brief (TWIM2) APB Base Address */
#define SAM4L_TWIM3                         (0x4007C000U) /**< \brief (TWIM3) APB Base Address */
#define SAM4L_TWIS0                         (0x40018400U) /**< \brief (TWIS0) APB Base Address */
#define SAM4L_TWIS1                         (0x4001C400U) /**< \brief (TWIS1) APB Base Address */
#define SAM4L_USART0                        (0x40024000U) /**< \brief (USART0) APB Base Address */
#define SAM4L_USART1                        (0x40028000U) /**< \brief (USART1) APB Base Address */
#define SAM4L_USART2                        (0x4002C000U) /**< \brief (USART2) APB Base Address */
#define SAM4L_USART3                        (0x40030000U) /**< \brief (USART3) APB Base Address */
#define SAM4L_USBC                          (0x400A5000U) /**< \brief (USBC) APB Base Address */
#define SAM4L_WDT                           (0x400F0C00U) /**< \brief (WDT) APB Base Address */
#elif defined(IOSONATA)
#define SAM4L_ABDACB            ((Abdacb   *)0x40064000U) /**< \brief (ABDACB) APB Base Address */
#define SAM4L_ABDACB_ADDR                   (0x40064000U) /**< \brief (ABDACB) APB Base Address */
#define SAM4L_ABDACB_INST_NUM   1                         /**< \brief (ABDACB) Number of instances */
#define SAM4L_ABDACB_INSTS      { SAM4L_ABDACB }                /**< \brief (ABDACB) Instances List */

#define SAM4L_ACIFC             ((Acifc    *)0x40040000U) /**< \brief (ACIFC) APB Base Address */
#define SAM4L_ACIFC_ADDR                    (0x40040000U) /**< \brief (ACIFC) APB Base Address */
#define SAM4L_ACIFC_INST_NUM    1                         /**< \brief (ACIFC) Number of instances */
#define SAM4L_ACIFC_INSTS       { SAM4L_ACIFC }                 /**< \brief (ACIFC) Instances List */

#define SAM4L_ADCIFE            ((Adcife   *)0x40038000U) /**< \brief (ADCIFE) APB Base Address */
#define SAM4L_ADCIFE_ADDR                   (0x40038000U) /**< \brief (ADCIFE) APB Base Address */
#define SAM4L_ADCIFE_INST_NUM   1                         /**< \brief (ADCIFE) Number of instances */
#define SAM4L_ADCIFE_INSTS      { SAM4L_ADCIFE }                /**< \brief (ADCIFE) Instances List */

#define SAM4L_AESA              ((Aesa     *)0x400B0000U) /**< \brief (AESA) AHB Base Address */
#define SAM4L_AESA_ADDR                     (0x400B0000U) /**< \brief (AESA) AHB Base Address */
#define SAM4L_AESA_INST_NUM     1                         /**< \brief (AESA) Number of instances */
#define SAM4L_AESA_INSTS        { SAM4L_AESA }                  /**< \brief (AESA) Instances List */

#define SAM4L_AST               ((Ast      *)0x400F0800U) /**< \brief (AST) APB Base Address */
#define SAM4L_AST_ADDR                      (0x400F0800U) /**< \brief (AST) APB Base Address */
#define SAM4L_AST_INST_NUM      1                         /**< \brief (AST) Number of instances */
#define SAM4L_AST_INSTS         { SAM4L_AST }                   /**< \brief (AST) Instances List */

#define SAM4L_BPM               ((Bpm      *)0x400F0000U) /**< \brief (BPM) APB Base Address */
#define SAM4L_BPM_ADDR                      (0x400F0000U) /**< \brief (BPM) APB Base Address */
#define SAM4L_BPM_INST_NUM      1                         /**< \brief (BPM) Number of instances */
#define SAM4L_BPM_INSTS         { SAM4L_BPM }                   /**< \brief (BPM) Instances List */

#define SAM4L_BSCIF             ((Bscif    *)0x400F0400U) /**< \brief (BSCIF) APB Base Address */
#define SAM4L_BSCIF_ADDR                    (0x400F0400U) /**< \brief (BSCIF) APB Base Address */
#define SAM4L_BSCIF_INST_NUM    1                         /**< \brief (BSCIF) Number of instances */
#define SAM4L_BSCIF_INSTS       { SAM4L_BSCIF }                 /**< \brief (BSCIF) Instances List */

#define SAM4L_CATB              ((Catb     *)0x40070000U) /**< \brief (CATB) APB Base Address */
#define SAM4L_CATB_ADDR                     (0x40070000U) /**< \brief (CATB) APB Base Address */
#define SAM4L_CATB_INST_NUM     1                         /**< \brief (CATB) Number of instances */
#define SAM4L_CATB_INSTS        { SAM4L_CATB }                  /**< \brief (CATB) Instances List */

#define SAM4L_CHIPID            ((Chipid   *)0x400E0400U) /**< \brief (CHIPID) APB Base Address */
#define SAM4L_CHIPID_ADDR                   (0x400E0400U) /**< \brief (CHIPID) APB Base Address */
#define SAM4L_CHIPID_INST_NUM   1                         /**< \brief (CHIPID) Number of instances */
#define SAM4L_CHIPID_INSTS      { SAM4L_CHIPID }                /**< \brief (CHIPID) Instances List */

#define SAM4L_CRCCU             ((Crccu    *)0x400A4000U) /**< \brief (CRCCU) APB Base Address */
#define SAM4L_CRCCU_ADDR                    (0x400A4000U) /**< \brief (CRCCU) APB Base Address */
#define SAM4L_CRCCU_INST_NUM    1                         /**< \brief (CRCCU) Number of instances */
#define SAM4L_CRCCU_INSTS       { SAM4L_CRCCU }                 /**< \brief (CRCCU) Instances List */

#define SAM4L_DACC              ((Dacc     *)0x4003C000U) /**< \brief (DACC) APB Base Address */
#define SAM4L_DACC_ADDR                     (0x4003C000U) /**< \brief (DACC) APB Base Address */
#define SAM4L_DACC_INST_NUM     1                         /**< \brief (DACC) Number of instances */
#define SAM4L_DACC_INSTS        { SAM4L_DACC }                  /**< \brief (DACC) Instances List */

#define SAM4L_EIC               ((Eic      *)0x400F1000U) /**< \brief (EIC) APB Base Address */
#define SAM4L_EIC_ADDR                      (0x400F1000U) /**< \brief (EIC) APB Base Address */
#define SAM4L_EIC_INST_NUM      1                         /**< \brief (EIC) Number of instances */
#define SAM4L_EIC_INSTS         { SAM4L_EIC }                   /**< \brief (EIC) Instances List */

#define SAM4L_HFLASHC           ((Flashcalw *)0x400A0000U) /**< \brief (HFLASHC) APB Base Address */
#define SAM4L_HFLASHC_ADDR                  (0x400A0000U) /**< \brief (HFLASHC) APB Base Address */
#define SAM4L_HFLASHC_FROW                  (0x00800200U) /**< \brief (HFLASHC) FROW Base Address */
#define SAM4L_HFLASHC_FROW_ADDR             (0x00800200U) /**< \brief (HFLASHC) FROW Base Address */
#define SAM4L_HFLASHC_USER                  (0x00800000U) /**< \brief (HFLASHC) USER Base Address */
#define SAM4L_HFLASHC_USER_ADDR             (0x00800000U) /**< \brief (HFLASHC) USER Base Address */
#define SAM4L_FLASHCALW_INST_NUM 1                         /**< \brief (FLASHCALW) Number of instances */
#define SAM4L_FLASHCALW_INSTS   { SAM4L_HFLASHC }               /**< \brief (FLASHCALW) Instances List */

#define SAM4L_FREQM             ((Freqm    *)0x400E0C00U) /**< \brief (FREQM) APB Base Address */
#define SAM4L_FREQM_ADDR                    (0x400E0C00U) /**< \brief (FREQM) APB Base Address */
#define SAM4L_FREQM_INST_NUM    1                         /**< \brief (FREQM) Number of instances */
#define SAM4L_FREQM_INSTS       { SAM4L_FREQM }                 /**< \brief (FREQM) Instances List */

#define SAM4L_GLOC              ((Gloc     *)0x40060000U) /**< \brief (GLOC) APB Base Address */
#define SAM4L_GLOC_ADDR                     (0x40060000U) /**< \brief (GLOC) APB Base Address */
#define SAM4L_GLOC_INST_NUM     1                         /**< \brief (GLOC) Number of instances */
#define SAM4L_GLOC_INSTS        { SAM4L_GLOC }                  /**< \brief (GLOC) Instances List */

