IOsonata/IOsonata/ARM/Microchip/SAM4L/include/sam4lc8x.h
#define SAM4L_GPIO              ((Gpio     *)0x400E1000U) /**< \brief (GPIO) APB Base Address */
#define SAM4L_GPIO_ADDR                     (0x400E1000U) /**< \brief (GPIO) APB Base Address */
#define SAM4L_GPIO_INST_NUM     1                         /**< \brief (GPIO) Number of instances */
#define SAM4L_GPIO_INSTS        { SAM4L_GPIO }                  /**< \brief (GPIO) Instances List */

#define SAM4L_HCACHE            ((Hcache   *)0x400A0400U) /**< \brief (HCACHE) APB Base Address */
#define SAM4L_HCACHE_ADDR                   (0x400A0400U) /**< \brief (HCACHE) APB Base Address */
#define SAM4L_HCACHE_INST_NUM   1                         /**< \brief (HCACHE) Number of instances */
#define SAM4L_HCACHE_INSTS      { SAM4L_HCACHE }                /**< \brief (HCACHE) Instances List */

#define SAM4L_HMATRIX           ((Hmatrixb *)0x400A1000U) /**< \brief (HMATRIX) APB Base Address */
#define SAM4L_HMATRIX_ADDR                  (0x400A1000U) /**< \brief (HMATRIX) APB Base Address */
#define SAM4L_HMATRIXB_INST_NUM 1                         /**< \brief (HMATRIXB) Number of instances */
#define SAM4L_HMATRIXB_INSTS    { SAM4L_HMATRIX }               /**< \brief (HMATRIXB) Instances List */

#define SAM4L_IISC              ((Iisc     *)0x40004000U) /**< \brief (IISC) APB Base Address */
#define SAM4L_IISC_ADDR                     (0x40004000U) /**< \brief (IISC) APB Base Address */
#define SAM4L_IISC_INST_NUM     1                         /**< \brief (IISC) Number of instances */
#define SAM4L_IISC_INSTS        { SAM4L_IISC }                  /**< \brief (IISC) Instances List */

#define SAM4L_LCDCA             ((Lcdca    *)0x40080000U) /**< \brief (LCDCA) APB Base Address */
#define SAM4L_LCDCA_ADDR                    (0x40080000U) /**< \brief (LCDCA) APB Base Address */
#define SAM4L_LCDCA_INST_NUM    1                         /**< \brief (LCDCA) Number of instances */
#define SAM4L_LCDCA_INSTS       { SAM4L_LCDCA }                 /**< \brief (LCDCA) Instances List */

#define SAM4L_PARC              ((Parc     *)0x4006C000U) /**< \brief (PARC) APB Base Address */
#define SAM4L_PARC_ADDR                     (0x4006C000U) /**< \brief (PARC) APB Base Address */
#define SAM4L_PARC_INST_NUM     1                         /**< \brief (PARC) Number of instances */
#define SAM4L_PARC_INSTS        { SAM4L_PARC }                  /**< \brief (PARC) Instances List */

#define SAM4L_PDCA              ((Pdca     *)0x400A2000U) /**< \brief (PDCA) APB Base Address */
#define SAM4L_PDCA_ADDR                     (0x400A2000U) /**< \brief (PDCA) APB Base Address */
#define SAM4L_PDCA_INST_NUM     1                         /**< \brief (PDCA) Number of instances */
#define SAM4L_PDCA_INSTS        { SAM4L_PDCA }                  /**< \brief (PDCA) Instances List */

#define SAM4L_PEVC              ((Pevc     *)0x400A6000U) /**< \brief (PEVC) APB Base Address */
#define SAM4L_PEVC_ADDR                     (0x400A6000U) /**< \brief (PEVC) APB Base Address */
#define SAM4L_PEVC_INST_NUM     1                         /**< \brief (PEVC) Number of instances */
#define SAM4L_PEVC_INSTS        { SAM4L_PEVC }                  /**< \brief (PEVC) Instances List */

#define SAM4L_PICOUART          ((Picouart *)0x400F1400U) /**< \brief (PICOUART) APB Base Address */
#define SAM4L_PICOUART_ADDR                 (0x400F1400U) /**< \brief (PICOUART) APB Base Address */
#define SAM4L_PICOUART_INST_NUM 1                         /**< \brief (PICOUART) Number of instances */
#define SAM4L_PICOUART_INSTS    { SAM4L_PICOUART }              /**< \brief (PICOUART) Instances List */

#define SAM4L_PM                ((Pm       *)0x400E0000U) /**< \brief (PM) APB Base Address */
#define SAM4L_PM_ADDR                       (0x400E0000U) /**< \brief (PM) APB Base Address */
#define SAM4L_PM_INST_NUM       1                         /**< \brief (PM) Number of instances */
#define SAM4L_PM_INSTS          { SAM4L_PM }                    /**< \brief (PM) Instances List */

#define SAM4L_SCIF              ((Scif     *)0x400E0800U) /**< \brief (SCIF) APB Base Address */
#define SAM4L_SCIF_ADDR                     (0x400E0800U) /**< \brief (SCIF) APB Base Address */
#define SAM4L_SCIF_INST_NUM     1                         /**< \brief (SCIF) Number of instances */
#define SAM4L_SCIF_INSTS        { SAM4L_SCIF }                  /**< \brief (SCIF) Instances List */

#define SAM4L_SMAP              ((Smap     *)0x400A3000U) /**< \brief (SMAP) APB Base Address */
#define SAM4L_SMAP_ADDR                     (0x400A3000U) /**< \brief (SMAP) APB Base Address */
#define SAM4L_SMAP_INST_NUM     1                         /**< \brief (SMAP) Number of instances */
#define SAM4L_SMAP_INSTS        { SAM4L_SMAP }                  /**< \brief (SMAP) Instances List */

#define SAM4L_SPI				((Sam4lSpi *)0x40008000U) /**< \brief (SPI) APB Base Address */
#define SAM4L_SPI_ADDR				  (0x40008000U) /**< \brief (SPI) APB Base Address */
#define SAM4L_SPI_INST_NUM		1                         /**< \brief (SPI) Number of instances */
#define SAM4L_SPI_INSTS			{ SAM4L_SPI }             /**< \brief (SPI) Instances List */

#define SAM4L_TC0               ((Tc       *)0x40010000U) /**< \brief (TC0) APB Base Address */
#define SAM4L_TC0_ADDR                      (0x40010000U) /**< \brief (TC0) APB Base Address */
#define SAM4L_TC1               ((Tc       *)0x40014000U) /**< \brief (TC1) APB Base Address */
#define SAM4L_TC1_ADDR                      (0x40014000U) /**< \brief (TC1) APB Base Address */
#define SAM4L_TC_INST_NUM       2                         /**< \brief (TC) Number of instances */
#define SAM4L_TC_INSTS          { SAM4L_TC0, SAM4L_TC1 }              /**< \brief (TC) Instances List */

#define SAM4L_TRNG              ((Trng     *)0x40068000U) /**< \brief (TRNG) APB Base Address */
#define SAM4L_TRNG_ADDR                     (0x40068000U) /**< \brief (TRNG) APB Base Address */
#define SAM4L_TRNG_INST_NUM     1                         /**< \brief (TRNG) Number of instances */
#define SAM4L_TRNG_INSTS        { SAM4L_TRNG }                  /**< \brief (TRNG) Instances List */

#define SAM4L_TWIM0             ((Twim     *)0x40018000U) /**< \brief (TWIM0) APB Base Address */
#define SAM4L_TWIM0_ADDR                    (0x40018000U) /**< \brief (TWIM0) APB Base Address */
#define SAM4L_TWIM1             ((Twim     *)0x4001C000U) /**< \brief (TWIM1) APB Base Address */
#define SAM4L_TWIM1_ADDR                    (0x4001C000U) /**< \brief (TWIM1) APB Base Address */
#define SAM4L_TWIM2             ((Twim     *)0x40078000U) /**< \brief (TWIM2) APB Base Address */
#define SAM4L_TWIM2_ADDR                    (0x40078000U) /**< \brief (TWIM2) APB Base Address */
#define SAM4L_TWIM3             ((Twim     *)0x4007C000U) /**< \brief (TWIM3) APB Base Address */
#define SAM4L_TWIM3_ADDR                    (0x4007C000U) /**< \brief (TWIM3) APB Base Address */
#define SAM4L_TWIM_INST_NUM     4                         /**< \brief (TWIM) Number of instances */
#define SAM4L_TWIM_INSTS        { SAM4L_TWIM0, SAM4L_TWIM1, SAM4L_TWIM2, SAM4L_TWIM3 } /**< \brief (TWIM) Instances List */

#define SAM4L_TWIS0             ((Twis     *)0x40018400U) /**< \brief (TWIS0) APB Base Address */
#define SAM4L_TWIS0_ADDR                    (0x40018400U) /**< \brief (TWIS0) APB Base Address */
#define SAM4L_TWIS1             ((Twis     *)0x4001C400U) /**< \brief (TWIS1) APB Base Address */
#define SAM4L_TWIS1_ADDR                    (0x4001C400U) /**< \brief (TWIS1) APB Base Address */
#define SAM4L_TWIS_INST_NUM     2                         /**< \brief (TWIS) Number of instances */
#define SAM4L_TWIS_INSTS        { SAM4L_TWIS0, SAM4L_TWIS1 }          /**< \brief (TWIS) Instances List */

#define SAM4L_USART0            ((Usart    *)0x40024000U) /**< \brief (USART0) APB Base Address */
#define SAM4L_USART0_ADDR                   (0x40024000U) /**< \brief (USART0) APB Base Address */
#define SAM4L_USART1            ((Usart    *)0x40028000U) /**< \brief (USART1) APB Base Address */
#define SAM4L_USART1_ADDR                   (0x40028000U) /**< \brief (USART1) APB Base Address */
#define SAM4L_USART2            ((Usart    *)0x4002C000U) /**< \brief (USART2) APB Base Address */
#define SAM4L_USART2_ADDR                   (0x4002C000U) /**< \brief (USART2) APB Base Address */
#define SAM4L_USART3            ((Usart    *)0x40030000U) /**< \brief (USART3) APB Base Address */
#define SAM4L_USART3_ADDR                   (0x40030000U) /**< \brief (USART3) APB Base Address */
#define SAM4L_USART_INST_NUM    4                         /**< \brief (USART) Number of instances */
#define SAM4L_USART_INSTS       { SAM4L_USART0, SAM4L_USART1, SAM4L_USART2, SAM4L_USART3 } /**< \brief (USART) Instances List */

#define SAM4L_USBC              ((Usbc     *)0x400A5000U) /**< \brief (USBC) APB Base Address */
#define SAM4L_USBC_ADDR                     (0x400A5000U) /**< \brief (USBC) APB Base Address */
#define SAM4L_USBC_INST_NUM     1                         /**< \brief (USBC) Number of instances */
#define SAM4L_USBC_INSTS        { SAM4L_USBC }                  /**< \brief (USBC) Instances List */

